<a href="https://colab.research.google.com/github/tegarpermanaputra21-sudo/praktikum-basisdata/blob/main/Bab5.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# ðŸ“˜ 5.2 TEST AWAL â€“ DATA MANIPULATION LANGUAGE (DML)

Tuliskan jawaban berikut pada kertas dengan **tulisan tangan**, sertakan **Nama, NIM, dan Kelas**.

<br>

---

## 1. Bagaimana cara memasukkan data ke tabel? Beri contoh!

Untuk memasukkan data ke dalam tabel digunakan perintah **INSERT INTO**.

### Sintaks:
```sql
INSERT INTO Nama_Tabel (kolom1, kolom2, kolom3)
VALUES ('nilai1', 'nilai2', 'nilai3');
```

Contoh:

Memasukkan data ke tabel Mahasiswa:
```sqlINSERT INTO Mahasiswa (NIM, Nama, Prodi)
VALUES ('23010201', 'Budi Saputra', 'Informatika');
```

## 2. Bagaimana cara menghapus data dari tabel? Beri contoh!

Untuk menghapus data digunakan perintah DELETE.

Sintaks:

```sql
DELETE FROM Nama_Tabel
WHERE kondisi;
```

Gunakan WHERE, karena tanpa WHERE seluruh data akan terhapus.

<br>

Contoh:

Menghapus mahasiswa dengan NIM tertentu:
```sql
DELETE FROM Mahasiswa
WHERE NIM = '23010201';
```

<br>

## 5.3 INSERT TABLE

**INSERT** digunakan untuk memasukkan data ke dalam tabel yang sudah ada.

<br>

Sintaks 1 (tanpa menyebut nama field)
```sql
INSERT INTO Nama_Table VALUES
(Isi_Field_1, Isi_Field_2, ..., Isi_Field_N);
```

<br>

Sintaks 2 (lebih aman, menyebut nama kolom)
```sql
INSERT INTO Nama_Table
(Nama_Field_1, Nama_Field_2, ..., Nama_Field_N)
VALUES
(Isi_Field_1, Isi_Field_2, ..., Isi_Field_N);
```

<br>

Contoh (Order Entry)
```sql
INSERT INTO Mahasiswa VALUES ('05052652', 'Paijo', 'Jalan Wates km 11');
```

<br>

## 5.4 QUERY SEDERHANA (SELECT)

Perintah SELECT digunakan untuk:

- Menampilkan seluruh data dalam tabel

- Menampilkan data tertentu

- Mengurutkan data (ascending / descending)

<br>

###5.4.1 Menampilkan Seluruh Data
Sintaks:
```sql
SELECT * FROM Nama_Table;
```

Contoh:
```sql
SELECT * FROM Mahasiswa;
```

<br>

5.4.2 Menampilkan Kolom Tertentu
Sintaks:
```sql
SELECT Nama_Field_1, Nama_Field_2
FROM Nama_Table;
```

Contoh:
```sql
SELECT NIM, Nama_Mhs
FROM Mahasiswa;
```

<br>

5.4.3 Menampilkan Baris Tertentu (Dengan Kondisi)
Sintaks:
```sql
SELECT * FROM Nama_Table
WHERE kondisi;
```

Contoh:
```sql
SELECT NIM, Nama_Mhs
FROM Mahasiswa
WHERE NIM = '05052652';
```

<br>

## 5.5 UPDATE TABLE
UPDATE digunakan untuk mengubah data yang sudah ada dalam tabel.

Sintaks:
```sql
UPDATE Nama_Table
SET Nama_Field = 'Data_Baru'
WHERE Nama_Field_Key = 'Data_Key';

```

Contoh:
```sql
UPDATE customers
SET cust_address = 'Gejayan Yogya',
    cust_country = 'INA'
WHERE cust_id = '10002';
```

<br>

## 5.6 DELETE DATA
DELETE digunakan untuk menghapus data dari tabel.

Sintaks:
```sql
DELETE FROM Nama_Table
WHERE Nama_Field_Key = 'Nilai_Key';

```

Contoh:
```sql
DELETE FROM Mhs_2
WHERE ID = '5';
```
Jika menggunakan DELETE FROM Nama_Table; tanpa WHERE â†’ semua data terhapus.

<br>

## 5.7 QUERY DENGAN KONDISI
Digunakan untuk mengambil data berdasarkan syarat tertentu.

Sintaks:
```sql
SELECT * FROM Nama_Table
WHERE kondisi;
```

<br>

### Operator Relasional

| Operator | Keterangan                   |
| -------- | ---------------------------- |
| =        | Sama dengan                  |
| >        | Lebih besar dari             |
| <        | Lebih kecil dari             |
| >=       | Lebih besar atau sama dengan |
| <=       | Lebih kecil atau sama dengan |
| <>       | Tidak sama dengan            |

<br>

Contoh 1:
```sql
SELECT * FROM customer
WHERE cust_id = '10003' OR cust_name = 'wascals';
```

Contoh 2:
```sql
SELECT prod_name
FROM products
WHERE prod_price >= 20;
```